/*********************************************************************************************
* 文件：dht11.c
* 作者：Lusi 2014.12.22
* 说明：温湿度传感器驱动程序
*       采用DHT11数字温湿度传感器，通过P0_5模拟单总线来进行温湿度数据的读取
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <ioCC2530.h>
#include <stdio.h>
#include "dht11.h"

/*********************************************************************************************
* 宏定义
*********************************************************************************************/
#define PIN_CFG (P0SEL &= ~0x20)
#define PIN_OUT (P0DIR |= 0x20)
#define PIN_IN P0DIR &= ~0x20)
#define PIN_CLR (P0_5 = 0)
#define PIN_SET (P0_5 = 1)
#define PIN_R (P0_5)

#define COM_OUT PIN_OUT
#define COM_IN PIN_IN  
#define COM_CLR PIN_CLR
#define COM_SET PIN_SET
#define COM_R PIN_R

/*********************************************************************************************
* 函数原型
*********************************************************************************************/
static void DelaymS (unsigned int dly);

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static unsigned char sTemp;                                     // 保存温度值
static unsigned char sHumidity;                                 // 保存湿度值

/*********************************************************************************************
* 名称：DelaymS()
* 功能：1mS定时
* 参数：dly -- 待延时的时间
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
#pragma optimize=none      
static void DelaymS (unsigned int dly)                   
{
  unsigned int i;
  for ( ; dly>0; dly--)
  {
    for (i=0; i<1032; i++);        
  }
}

/*********************************************************************************************
* 名称：dht11_read_bit()
* 功能：温湿度传感器读一个数据位
* 参数：无
* 返回：返回位 1 或者 0
* 修改：
* 注释：
*********************************************************************************************/
#pragma optimize=none
static char dht11_read_bit(void)
{
  int i = 0;
  
  while (!COM_R);
  for (i=0; i<200; i++) {
    if (COM_R == 0) break;
  }
  if (i<30) return 0;                                           // 计数小于30us则为低电平
  return 1;                                                     // 计数大于30us则为低电平
}

/*********************************************************************************************
* 名称：dht11_read_byte()
* 功能：温湿度传感器读一个数据字节
* 参数：无
* 返回：v -- 返回一个字节数据
* 修改：
* 注释：
*********************************************************************************************/
#pragma optimize=none
static unsigned char dht11_read_byte(void)
{
  unsigned char v = 0, b;
  int i;
  for (i=7; i>=0; i--) {
    b = dht11_read_bit();
    v |= b<<i;
  }
  return v; 
}

/*********************************************************************************************
* 名称：dht11_io_init()
* 功能：温湿度传感器IO口的初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void dht11_io_init(void)
{
  PIN_CFG;
  COM_OUT;
  COM_SET;
}

/*********************************************************************************************
* 名称：dht11_temp()
* 功能：获取温度值
* 参数：无
* 返回：sTemp -- 温度值
* 修改：
* 注释：
*********************************************************************************************/
unsigned char dht11_temp(void)
{
  return sTemp;
}

/*********************************************************************************************
* 名称：dht11_humidity()
* 功能：获取湿度值
* 参数：无
* 返回：sHumidity -- 湿度值
* 修改：
* 注释：
*********************************************************************************************/
unsigned char dht11_humidity(void)
{
  return sHumidity;
}

/*********************************************************************************************
* 名称：dht11_update()
* 功能：更新一次温湿度值，保存到全部静态变量中：sTemp、sHumidity
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void dht11_update(void)
{
  int flag = 1;
  unsigned char dat1, dat2, dat3, dat4, dat5, ck;
  
  // 主机拉低电平18ms 
  COM_CLR;
  DelaymS(18);

  // 主机拉高电平直到被DHT拉低电平
  COM_SET;
  flag = 0;
  while (COM_R && ++flag);
  if (flag == 0) return;
  
  // DHT响应信号结束后，拉高电平	  	    
  flag = 0;
  while (!COM_R && ++flag);
  if (flag == 0) return;
  // DHT拉高电平后，再次拉低电平开始准备接收数据
  flag = 0;
  while (COM_R && ++flag);
  if (flag == 0) return;
  
  // 开始读取温湿度数据
  dat1 = dht11_read_byte();                                     // 读取湿度整数数据
  dat2 = dht11_read_byte();                                     // 读取湿度小数数据
  dat3 = dht11_read_byte();                                     // 读取温度整数数据
  dat4 = dht11_read_byte();                                     // 读取温度小数数据
  dat5 = dht11_read_byte();                                     // 读取校验和数据

  ck = dat1 + dat2 + dat3 + dat4;
  if (ck == dat5) {                                             // 校验数据
    sTemp = dat3;
    sHumidity = dat1;        
  }   
}