/*********************************************************************************************
* 文件：WaterproofTemp.c
* 作者：Dengcy 2015.2.5
* 说明：防水温度驱动程序
* 修改：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "WaterproofTemp.h"

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
unsigned char sensor_data_value[2];       //传感器数据
unsigned char FRACTION_INDEX[16] = {0, 1, 1, 2, 2, 3, 4, 4, 5, 6, 6, 7, 7, 8, 9, 9 };//小数值查询表

/*********************************************************************************************
* 名称：delay_nus()
* 功能：延时
* 参数：延时时间timeout
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void delay_nus(uint16 timeout)
{
    while (timeout--)
    {
        asm("NOP");
        asm("NOP");
        asm("NOP");
    }
}

/*********************************************************************************************
* 名称：DS18B20_Write()
* 功能：写数据
* 参数：命令cmd（DS18B20.H中定义）
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void DS18B20_Write(unsigned char cmd)
{
    unsigned char i;
    SET_OUT();                //设置IO为输出，2530->DS18B20
    
    /*每次一位，循环8次*/
    for(i=0; i<8; i++)
    {
        CL_DQ();              //IO为低    
        if( cmd & (1<<i) )    //写数据从低位开始
        {
          SET_DQ();           //IO输入高电平
        }
        else
        {
          CL_DQ();            //IO输出低电平
        }
        delay_nus(40);        //保持15~60us
        SET_DQ();             //IO口拉高
    }
    SET_DQ();                 //IO口拉高
}

/*********************************************************************************************
* 名称：DS18B20_Read()
* 功能：读数据
* 参数：无
* 返回：读取的数据
* 修改：
* 注释：
*********************************************************************************************/
unsigned char DS18B20_Read(void)
{
    unsigned char rdData;     //读出的数据
    unsigned char i, dat;     //临时变量
    
    rdData = 0;               //读出的数据初始化为0     
    
    /* 每次读一位，读8次 */
    for(i=0; i<8; i++)
    {
        CL_DQ();              //IO拉低
        SET_DQ();             //IO拉高
        SET_IN();             //设置IO方向为输入 DS18B20->CC2530
        dat = DQ;             //读数据,从低位开始
        
        if(dat)
        {
          rdData |= (1<<i);   //如果读出的数据位为正
        }
        else
        {
          rdData &= ~(1<<i);  //如果读出的数据位为负
        }
        
        delay_nus(70);        //保持60~120us
        SET_OUT();            //设置IO方向为输出 CC2530->DS18B20

    }
    return (rdData);          //返回读出的数据
}

/*********************************************************************************************
* 名称：DS18B20_Init()
* 功能：传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void DS18B20_Init(void)
{
    SET_OUT();
    SET_DQ();         //IO口拉高
    CL_DQ();          //IO口拉低
    delay_nus(550);   //IO拉低后保持一段时间 480-960us
    SET_DQ();         //释放
    SET_IN();         //IO方向为输入 DS18B20->CC2530
    delay_nus(40);    //释放总线后等待15-60us
    
    /* 等待DQ变低 */
    while(DQ)
    {
        ; 
    }
    delay_nus(240);   //检测到DQ 变低后，延时60-240us
    SET_OUT();        //设置IO方向为输出 CC2530->DS18B20
    SET_DQ();         //IO拉高
}

/*********************************************************************************************
* 名称：DS18B20_SendConvert()
* 功能：转换温度
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void DS18B20_SendConvert(void)
{
    DS18B20_Init();               //复位18B20
    DS18B20_Write(SKIP_ROM);      //发出跳过ROM匹配操作
    DS18B20_Write(CONVERT_T);     //启动温度转换
}

/*********************************************************************************************
* 名称：DS18B20_GetTem()
* 功能：获取温度
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void DS18B20_GetTem(void)
{
    unsigned char tem_h,tem_l;    //温度高位字节及低位字节
    unsigned char a,b;            //临时变量
    unsigned char flag;           //温度正负标记，正为0，负为1
    
    DS18B20_Init();               //DS18B20复位       
    DS18B20_Write(SKIP_ROM);      //跳过ROM匹配
    
    DS18B20_Write(RD_SCRATCHPAD); //写便笺
    tem_l = DS18B20_Read();       //读温度低位
    tem_h = DS18B20_Read();       //读温度高位

    /* 判断温度正负 */
    if(tem_h & 0x80)
    {
        flag = 1;                 //温度为负
        a = (tem_l>>4);           //取温度低4位原码
        b = (tem_h<<4)& 0xf0;     //取温度高4位原码
        tem_h = ~(a|b) + 1;       //取整数部分数值，不符号位
        
        tem_l = ~(a&0x0f) + 1;    //取小数部分原值，不含符号位
    }
    else
    {
        flag = 0;                 //为正
        a = tem_h<<4;
        a += (tem_l&0xf0)>>4;     //得到整数部分值 
        b = tem_l&0x0f;           //得出小数部分值
        tem_h = a;                //整数部分
        tem_l = b&0xff;           //小数部分
    }
    
    sensor_data_value[0] = FRACTION_INDEX[tem_l]; //查表得小数值
    sensor_data_value[1] = tem_h| (flag<<7);      //整数部分，包括符号位
}




